tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mongodb/brew"
tap "spring-io/tap"
brew "aichat"
brew "cryptography"
brew "python@3.12"
brew "ansible"
brew "python@3.11"
brew "awscli"
brew "chezmoi"
brew "direnv"
brew "git"
brew "harfbuzz"
brew "neovim"
brew "node@16"
brew "nvm"
brew "openjdk@11"
brew "openjdk@17"
brew "redis", restart_service: true
brew "spring-io/tap/spring-boot"
cask "1password"
cask "amazon-q"
cask "arc"
cask "discord"
cask "docker"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "google-drive"
cask "intellij-idea-ce"
cask "iterm2"
cask "logi-options+"
cask "microsoft-edge"
cask "mongodb-compass"
cask "netdownloadhelpercoapp"
cask "postman"
cask "steam"
cask "surfshark"
cask "via"
cask "visual-studio-code"
vscode "akamud.vscode-theme-onedark"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "angular.ng-template"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-elasticsearch-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "hbenl.vscode-test-explorer"
vscode "mhutchie.git-graph"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vscode.test-adapter-converter"
vscode "naco-siren.gradle-language"
vscode "nrwl.angular-console"
vscode "orta.vscode-jest"
vscode "redhat.java"
vscode "ria.elastic"
vscode "richardwillis.vscode-gradle-extension-pack"
vscode "streetsidesoftware.code-spell-checker"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
