tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "spring-io/tap"
brew "aichat"
brew "chezmoi"
brew "direnv"
brew "git"
brew "n"
brew "neovim"
brew "openjdk@11"
brew "openjdk@17"
brew "openjdk@8"
brew "spring-io/tap/spring-boot"
cask "1password"
cask "arc"
cask "discord"
cask "expressvpn"
cask "fig"
cask "google-chrome"
cask "intellij-idea-ce"
cask "iterm2"
cask "logi-options-plus"
cask "via"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
vscode "akamud.vscode-theme-onedark"
vscode "Angular.ng-template"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "d-biehl.robotcode"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-elasticsearch-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "hashicorp.terraform"
vscode "johnpapa.vscode-peacock"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.java"
vscode "ria.elastic"
vscode "robocorp.robotframework-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "vmware.vscode-spring-boot"
vscode "vscode-icons-team.vscode-icons"
vscode "withfig.fig"
