tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mongodb/brew"
tap "spring-io/tap"
brew "aichat"
brew "ansible"
brew "chezmoi"
brew "direnv"
brew "git"
brew "n"
brew "neovim"
brew "openjdk@11"
brew "openjdk@17"
brew "redis", restart_service: true
brew "mongodb/brew/mongodb-community"
brew "spring-io/tap/spring-boot"
cask "1password"
cask "arc"
cask "discord"
cask "docker"
cask "expressvpn"
cask "fig"
cask "flux"
cask "google-chrome"
cask "intellij-idea-ce"
cask "iterm2"
cask "logi-options-plus"
cask "postman"
cask "surfshark"
cask "via"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
vscode "akamud.vscode-theme-onedark"
vscode "Angular.ng-template"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-elasticsearch-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "mhutchie.git-graph"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "naco-siren.gradle-language"
vscode "redhat.java"
vscode "ria.elastic"
vscode "richardwillis.vscode-gradle-extension-pack"
vscode "streetsidesoftware.code-spell-checker"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "wingrunr21.vscode-ruby"
vscode "withfig.fig"
